app/views/cart/_cart.html.erb


        <% if @cart.orderables.count %>
---
SELECT COUNT(*) FROM "orderables" WHERE "orderables"."cart_id" = ?  [["cart_id", 1]]