app/controllers/cart_controller.rb

  def add
   @product = Product.find_by(id: params[:id])
   quantity = params[:quantity].to_i
   current_orderable = @cart.orderables.find_by(product_id: @product.id)
   if current_orderable && quantity > 0
     current_orderable.update(quantity:)
   elsif quantity <=0
     current_orderable.destroy
   else
     @cart.orderables.create(product: @product, quantity:)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."cart_id" = ? AND "orderables"."product_id" = ? LIMIT ?  [["cart_id", 1], ["product_id", 1], ["LIMIT", 1]]
UPDATE "orderables" SET "quantity" = ?, "updated_at" = ? WHERE "orderables"."id" = ?  [["quantity", 2], ["updated_at", "2023-10-05 17:28:53.282413"], ["id", 1]]
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 1]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orderables" ("product_id", "cart_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["quantity", 1], ["created_at", "2023-10-05 17:28:22.432007"], ["updated_at", "2023-10-05 17:28:22.432007"]]

  def remove
    Orderable.find_by(id: params[:id]).destroy
---
DELETE FROM "orderables" WHERE "orderables"."id" = ?  [["id", 8]]
SELECT "orderables".* FROM "orderables" WHERE "orderables"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]