app/controllers/products_controller.rb

INSERT INTO "products" ("name", "decription", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Book"], ["decription", "Words"], ["price", 999.0], ["created_at", "2023-10-05 15:00:11.242221"], ["updated_at", "2023-10-05 15:00:11.242221"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save